frontend/modules/task/controllers/TaskController.php

INSERT INTO `task` (`created_at`, `custom_name`, `custom_phone`, `task_date`, `service_type`) VALUES ('21-08-24', '', '', NULL, '')
---
    public function actionCreate()
    {
        if(Yii::$app->user->can( 'admin' )){
            //new model
            $model = new Task();
            $model->created_at = date("y-m-d");


            if ($this->request->isPost) {
                if ($model->load($this->request->post())) {
                    $follow = $_POST['Task']['Follower'];

                    $model->save(false);