frontend/modules/task/views/task/_form.php

SELECT * FROM `user`
---
    <?php $form = ActiveForm::begin(); ?>

    <?php
     $Follower = User::find()->all();