frontend/modules/task/views/task/index.php

SELECT `task`.* FROM `task` INNER JOIN `usertask` ON usertask.task_id = task.id WHERE `usertask`.`user_id`=2 ORDER BY `task task_date`
SELECT `task`.* FROM `task` INNER JOIN `usertask` ON usertask.task_id = task.id WHERE (`usertask`.`user_id`=2) AND (1 IS FALSE)
---
        # code...

        // query search tasks where task_id in user_task (user is login id = user_id) equale task id in task table
        $dataProvide = (new \yii\db\Query())
            ->select('task.*')
            ->from('task')
            ->innerJoin('usertask', 'usertask.task_id = task.id')
            ->where(['usertask.user_id' => Yii::$app->user->getId()])
            //->orWhere(['AND',['created_at' <= date('Y-m-d 00:00:00')],['created_at'<= '2021-08-26 00:00:00']])
            ->all();